Revit 2027 API
BuiltInFailures.StructuralLoadFailures.CannotPlaceBoundaryConditions Property
 A boundary condition is already created on the selected element. Duplicate boundary conditions are not allowed. Click the Replace button to delete previous definition of boundary condition or cancel the operation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlaceBoundaryConditions { get; }
Public Shared ReadOnly Property CannotPlaceBoundaryConditions As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlaceBoundaryConditions {
	FailureDefinitionId^ get ();
}
static member CannotPlaceBoundaryConditions : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralLoadFailures Class
Autodesk.Revit.DB Namespace